In [226]:
import pandas as pd
import numpy as np


## Reading data: Books, Ratings, Users
books = pd.read_csv("../data/Books.csv", sep=',', dtype='unicode')
ratings = pd.read_csv("../data/Ratings.csv", sep=',', dtype='unicode')
users = pd.read_csv("../data/Users.csv", sep=',', dtype='unicode')

In [227]:
## Books Data
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0195153448.01.LZZZZZZZ.jpg
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0002005018.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0002005018.01.LZZZZZZZ.jpg
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0060973129.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0060973129.01.LZZZZZZZ.jpg
3,0374157065,Flu: The Story of the Great Influenza Pandemic of 1918 and the Search for the Virus That Caused It,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0374157065.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0374157065.01.LZZZZZZZ.jpg
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0393045218.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0393045218.01.LZZZZZZZ.jpg

In [228]:
books.shape

(271360, 8)

In [229]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [230]:
#Since I will be using only Image-URL-L to display in the UI, I shall delete the other S and M images
# books.drop(["Image-URL-S", "Image-URL-M"], axis = 1, inplace=True)

In [231]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0195153448.01.LZZZZZZZ.jpg
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0002005018.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0002005018.01.LZZZZZZZ.jpg
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0060973129.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0060973129.01.LZZZZZZZ.jpg
3,0374157065,Flu: The Story of the Great Influenza Pandemic of 1918 and the Search for the Virus That Caused It,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0374157065.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0374157065.01.LZZZZZZZ.jpg
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0393045218.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0393045218.01.LZZZZZZZ.jpg

In [232]:
##Data cleaning

### To check if there are any null values present in the data

books.isna().sum()

ISBN                   0
Book-Title             0
Book-Author            2
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64

In [233]:
books.loc[books['Book-Author'].isna(), :]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
118033,0751352497,A+ Quiz Masters:01 Earth,NaN,1999,Dorling Kindersley,http://images.amazon.com/images/P/0751352497.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0751352497.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0751352497.01.LZZZZZZZ.jpg
187689,9627982032,The Credit Suisse Guide to Managing Your Personal Wealth,NaN,1995,Edinburgh Financial Publishing,http://images.amazon.com/images/P/9627982032.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/9627982032.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/9627982032.01.LZZZZZZZ.jpg

In [234]:
books.at[118033, 'Book-Author'] = 'Other'
books.at[187689, 'Book-Author'] = 'Other'

In [235]:
books.loc[books['Book-Author'] == 'Other']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
118033,0751352497,A+ Quiz Masters:01 Earth,Other,1999,Dorling Kindersley,http://images.amazon.com/images/P/0751352497.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0751352497.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0751352497.01.LZZZZZZZ.jpg
187689,9627982032,The Credit Suisse Guide to Managing Your Personal Wealth,Other,1995,Edinburgh Financial Publishing,http://images.amazon.com/images/P/9627982032.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/9627982032.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/9627982032.01.LZZZZZZZ.jpg

In [236]:
books.loc[books['Publisher'].isna(), :]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
128890,193169656X,Tyrant Moon,Elaine Corvidae,2002,NaN,http://images.amazon.com/images/P/193169656X.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/193169656X.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/193169656X.01.LZZZZZZZ.jpg
129037,1931696993,Finders Keepers,Linnea Sinclair,2001,NaN,http://images.amazon.com/images/P/1931696993.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/1931696993.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/1931696993.01.LZZZZZZZ.jpg

In [237]:
books.at[128890, 'Publisher'] = 'Other'
books.at[129037, 'Publisher'] = 'Other'

In [238]:
books.loc[books['Publisher'] == 'Other']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
128890,193169656X,Tyrant Moon,Elaine Corvidae,2002,Other,http://images.amazon.com/images/P/193169656X.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/193169656X.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/193169656X.01.LZZZZZZZ.jpg
129037,1931696993,Finders Keepers,Linnea Sinclair,2001,Other,http://images.amazon.com/images/P/1931696993.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/1931696993.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/1931696993.01.LZZZZZZZ.jpg

In [239]:
books.loc[books['Image-URL-L'].isna(), :]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
209538,078946697X,"DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)\"";Michael Teitelbaum""",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/078946697X.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/078946697X.01.LZZZZZZZ.jpg,NaN
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-Marie Gustave Le ClÃ?Â©zio""",2003,Gallimard,http://images.amazon.com/images/P/2070426769.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/2070426769.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/2070426769.01.LZZZZZZZ.jpg,NaN
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)\"";James Buckley""",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg,http://images.amazon.com/images/P/0789466953.01.MZZZZZZZ.jpg,http://images.amazon.com/images/P/0789466953.01.LZZZZZZZ.jpg,NaN

In [240]:
## We can see in the above, there are three rows with Image-URL-L column null. What we can also ovserve is that, The values for Book-Author and Year-of-Publication are interchanged.
## Also instead of publisher value is in Book-Title, so let's fix this
pd.set_option('display.max_colwidth', None)
books.loc[209538]

ISBN                                                                                                             078946697X
Book-Title             DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)\";Michael Teitelbaum"
Book-Author                                                                                                            2000
Year-Of-Publication                                                                                       DK Publishing Inc
Publisher                                                      http://images.amazon.com/images/P/078946697X.01.THUMBZZZ.jpg
Image-URL-S                                                    http://images.amazon.com/images/P/078946697X.01.MZZZZZZZ.jpg
Image-URL-M                                                    http://images.amazon.com/images/P/078946697X.01.LZZZZZZZ.jpg
Image-URL-L                                                                                                             NaN
Name: 209538, dtype: object

In [241]:
books.at[209538, 'Book-Title'] = "DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)"
books.at[209538, 'Book-Author'] = "Michael Teitelbaum"
books.at[209538, 'Year-Of-Publication'] = 2000
books.at[209538, 'Publisher'] = "DK Publishing Inc"
books.at[209538, 'Image-URL-S'] = "http://images.amazon.com/images/P/078946697X.01.THUMBZZZ.jpg"
books.at[209538, 'Image-URL-M'] = "http://images.amazon.com/images/P/078946697X.01.MZZZZZZZ.jpg"
books.at[209538, 'Image-URL-L'] = "http://images.amazon.com/images/P/078946697X.01.LZZZZZZZ.jpg"

books.loc[209538]

ISBN                                                                                       078946697X
Book-Title             DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)
Book-Author                                                                        Michael Teitelbaum
Year-Of-Publication                                                                              2000
Publisher                                                                           DK Publishing Inc
Image-URL-S                              http://images.amazon.com/images/P/078946697X.01.THUMBZZZ.jpg
Image-URL-M                              http://images.amazon.com/images/P/078946697X.01.MZZZZZZZ.jpg
Image-URL-L                              http://images.amazon.com/images/P/078946697X.01.LZZZZZZZ.jpg
Name: 209538, dtype: object

In [242]:
books.loc[221678]

ISBN                                                                                                                    0789466953
Book-Title             DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)\";James Buckley"
Book-Author                                                                                                                   2000
Year-Of-Publication                                                                                              DK Publishing Inc
Publisher                                                             http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg
Image-URL-S                                                           http://images.amazon.com/images/P/0789466953.01.MZZZZZZZ.jpg
Image-URL-M                                                           http://images.amazon.com/images/P/0789466953.01.LZZZZZZZ.jpg
Image-URL-L                                                                                                                    NaN
Name: 221678, dtype: object

In [243]:
books.at[221678, 'Book-Title'] = "DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)"
books.at[221678, 'Book-Author'] = "James Buckley"
books.at[221678, 'Year-Of-Publication'] = 2000
books.at[221678, 'Publisher'] = "DK Publishing Inc"
books.at[221678, 'Image-URL-S'] = "http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg"
books.at[221678, 'Image-URL-M'] = "http://images.amazon.com/images/P/0789466953.01.MZZZZZZZ.jpg"
books.at[221678, 'Image-URL-L'] = "http://images.amazon.com/images/P/0789466953.01.LZZZZZZZ.jpg"

books.loc[221678]

ISBN                                                                                                   0789466953
Book-Title             DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)
Book-Author                                                                                         James Buckley
Year-Of-Publication                                                                                          2000
Publisher                                                                                       DK Publishing Inc
Image-URL-S                                          http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg
Image-URL-M                                          http://images.amazon.com/images/P/0789466953.01.MZZZZZZZ.jpg
Image-URL-L                                          http://images.amazon.com/images/P/0789466953.01.LZZZZZZZ.jpg
Name: 221678, dtype: object

In [244]:
books.loc[220731]

ISBN                                                                                 2070426769
Book-Title             Peuple du ciel, suivi de 'Les Bergers\";Jean-Marie Gustave Le ClÃ?Â©zio"
Book-Author                                                                                2003
Year-Of-Publication                                                                   Gallimard
Publisher                          http://images.amazon.com/images/P/2070426769.01.THUMBZZZ.jpg
Image-URL-S                        http://images.amazon.com/images/P/2070426769.01.MZZZZZZZ.jpg
Image-URL-M                        http://images.amazon.com/images/P/2070426769.01.LZZZZZZZ.jpg
Image-URL-L                                                                                 NaN
Name: 220731, dtype: object

In [245]:
books.at[220731, 'Book-Title'] = "Peuple du ciel, suivi de 'Les Bergers"
books.at[220731, 'Book-Author'] = "Jean-Marie Gustave Le ClÃ?Â©zio"
books.at[220731, 'Year-Of-Publication'] = 2003
books.at[220731, 'Publisher'] = "Gallimard"
books.at[220731, 'Image-URL-S'] = "http://images.amazon.com/images/P/2070426769.01.THUMBZZZ.jpg"
books.at[220731, 'Image-URL-M'] = "http://images.amazon.com/images/P/2070426769.01.MZZZZZZZ.jpg"
books.at[220731, 'Image-URL-L'] = "http://images.amazon.com/images/P/2070426769.01.LZZZZZZZ.jpg"

books.loc[221678]

ISBN                                                                                                   0789466953
Book-Title             DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)
Book-Author                                                                                         James Buckley
Year-Of-Publication                                                                                          2000
Publisher                                                                                       DK Publishing Inc
Image-URL-S                                          http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg
Image-URL-M                                          http://images.amazon.com/images/P/0789466953.01.MZZZZZZZ.jpg
Image-URL-L                                          http://images.amazon.com/images/P/0789466953.01.LZZZZZZZ.jpg
Name: 221678, dtype: object

In [246]:
books['Year-Of-Publication'] = books['Year-Of-Publication'].astype(int)

In [247]:
print(sorted(list(books['Year-Of-Publication'].unique())))

[0, 1376, 1378, 1806, 1897, 1900, 1901, 1902, 1904, 1906, 1908, 1909, 1910, 1911, 1914, 1917, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2008, 2010, 2011, 2012, 2020, 2021, 2024, 2026, 2030, 2037, 2038, 2050]

In [248]:
## In the above we can see that the year of publication has values which are greater than 2023 which is not valid. So we shall replace invalid years with 2023
books.loc[books['Year-Of-Publication'] > 2021, 'Year-Of-Publication'] = 2023
books.loc[books['Year-Of-Publication'] == 0, 'Year-Of-Publication'] = 2023

In [249]:
## Uppercasing all alphabets in ISBN
books['ISBN'] = books['ISBN'].str.upper()

In [250]:
## Drop duplicate rows
books.drop_duplicates(keep='last', inplace=True) 
books.reset_index(drop = True, inplace = True)

In [251]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271047 entries, 0 to 271046
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271047 non-null  object
 1   Book-Title           271047 non-null  object
 2   Book-Author          271047 non-null  object
 3   Year-Of-Publication  271047 non-null  int32
 4   Publisher            271047 non-null  object
 5   Image-URL-S          271047 non-null  object
 6   Image-URL-M          271047 non-null  object
 7   Image-URL-L          271047 non-null  object
dtypes: int32(1), object(7)
memory usage: 15.5+ MB

In [252]:
ratings.head()

  User-ID        ISBN Book-Rating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

In [253]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  object
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  object
dtypes: object(3)
memory usage: 26.3+ MB

In [254]:
ratings.columns=ratings.columns.str.strip().str.lower().str.replace('-','_')

In [255]:
print(ratings.isnull().sum())

user_id        0
isbn           0
book_rating    0
dtype: int64

In [256]:
ratings.loc[(ratings['user_id'].isnull()),: ]

Empty DataFrame
Columns: [user_id, isbn, book_rating]
Index: []

In [257]:
unique_ratings = ratings[ratings['isbn'].isin(books['ISBN'])]
unique_ratings

        user_id        isbn book_rating
0        276725  034545104X           0
1        276726  0155061224           5
2        276727  0446520802           0
3        276729  052165615X           3
4        276729  0521795028           6
...         ...         ...         ...
1149774  276704  0876044011           0
1149775  276704  1563526298           9
1149776  276706  0679447156           0
1149777  276709  0515107662          10
1149778  276721  0590442449          10

[1030617 rows x 3 columns]

In [258]:
print(ratings.shape)
print(unique_ratings.shape)

(1149780, 3)
(1030617, 3)

In [259]:
unique_ratings['book_rating'].unique()

array(['0', '5', '3', '6', '7', '9', '8', '10', '1', '4', '2'],
      dtype=object)

In [260]:
from pandas.api.types import is_numeric_dtype
ratings.isnull().sum()

user_id        0
isbn           0
book_rating    0
dtype: int64

In [261]:
print(is_numeric_dtype(ratings['book_rating']))

False

In [262]:
print(is_numeric_dtype(ratings['user_id']))

False

In [263]:
ratings['book_rating'] = ratings['book_rating'].astype(int)
print(is_numeric_dtype(ratings['book_rating']))

True

In [264]:
ratings['user_id'] = ratings['user_id'].astype(int)
print(is_numeric_dtype(ratings['user_id']))

True

In [265]:
import re
isValid = 0
k =[]
reg = "[^A-Za-z0-9]"

for x in ratings['isbn']:
    z = re.search(reg,x)    
    if z:
        isValid = 1

if isValid == 1:
    print("False")
else:
    print("True")

False

In [266]:
bookISBN = books['ISBN'].tolist() 
reg = "[^A-Za-z0-9]" 
for index, row_Value in ratings.iterrows():
    z = re.search(reg, row_Value['isbn'])    
    if z:
        f = re.sub(reg,"",row_Value['isbn'])
        if f in bookISBN:
            ratings.at[index , 'isbn'] = f

In [ ]:
ratings['isbn'] = ratings['isbn'].str.upper()

In [ ]:
ratings.drop_duplicates(keep='last', inplace=True)
ratings.reset_index(drop=True, inplace=True)

In [ ]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149776 entries, 0 to 1149775
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   user_id      1149776 non-null  int32
 1   isbn         1149776 non-null  object
 2   book_rating  1149776 non-null  int32
dtypes: int32(2), object(1)
memory usage: 17.5+ MB

In [ ]:
ratings.head()

   user_id        isbn  book_rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [ ]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  object
 1   Location  278858 non-null  object
 2   Age       168096 non-null  object
dtypes: object(3)
memory usage: 6.4+ MB

In [ ]:
users.head()

  User-ID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

In [ ]:
users.shape

(278858, 3)

In [ ]:
users['Location'].unique()

array(['nyc, new york, usa', 'stockton, california, usa',
       'moscow, yukon territory, russia', ...,
       'sergnano, lombardia, italy', 'stranraer, n/a, united kingdom',
       'tacoma, washington, united kingdom'], dtype=object)

In [ ]:
print(users.isna().sum())

User-ID          0
Location         0
Age         110762
dtype: int64

In [ ]:
users['Age'] = pd.to_numeric(users['Age'], errors='coerce')
users['Age'].fillna((users['Age'].mean()), inplace=True)
users['Age'].unique()

array([ 34.7514337,  18.       ,  17.       ,  61.       ,  26.       ,
        14.       ,  25.       ,  19.       ,  46.       ,  55.       ,
        32.       ,  24.       ,  20.       ,  34.       ,  23.       ,
        51.       ,  31.       ,  21.       ,  44.       ,  30.       ,
        57.       ,  43.       ,  37.       ,  41.       ,  54.       ,
        42.       ,  50.       ,  39.       ,  53.       ,  47.       ,
        36.       ,  28.       ,  35.       ,  13.       ,  58.       ,
        49.       ,  38.       ,  45.       ,  62.       ,  63.       ,
        27.       ,  33.       ,  29.       ,  66.       ,  40.       ,
        15.       ,  60.       ,   0.       ,  79.       ,  22.       ,
        16.       ,  65.       ,  59.       ,  48.       ,  72.       ,
        56.       ,  67.       ,   1.       ,  80.       ,  52.       ,
        69.       ,  71.       ,  73.       ,  78.       ,   9.       ,
        64.       , 103.       , 104.       ,  12.       ,  74.       ,
        75.       , 231.       ,   3.       ,  76.       ,  83.       ,
        68.       , 119.       ,  11.       ,  77.       ,   2.       ,
        70.       ,  93.       ,   8.       ,   7.       ,   4.       ,
        81.       , 114.       , 230.       , 239.       ,  10.       ,
         5.       , 148.       , 151.       ,   6.       , 101.       ,
       201.       ,  96.       ,  84.       ,  82.       ,  90.       ,
       123.       , 244.       , 133.       ,  91.       , 128.       ,
        94.       ,  85.       , 141.       , 110.       ,  97.       ,
       219.       ,  86.       , 124.       ,  92.       , 175.       ,
       172.       , 209.       , 212.       , 237.       ,  87.       ,
       162.       , 100.       , 156.       , 136.       ,  95.       ,
        89.       , 106.       ,  99.       , 108.       , 210.       ,
        88.       , 199.       , 147.       , 168.       , 132.       ,
       159.       , 186.       , 152.       , 102.       , 116.       ,
       200.       , 115.       , 226.       , 137.       , 207.       ,
       229.       , 138.       , 109.       , 105.       , 228.       ,
       183.       , 204.       ,  98.       , 223.       , 113.       ,
       208.       , 107.       , 157.       , 111.       , 146.       ,
       118.       , 220.       , 143.       , 140.       , 189.       ,
       127.       ])

In [ ]:
print(users.isna().sum())

User-ID     0
Location    0
Age         0
dtype: int64

In [ ]:
users['User-ID'].unique()

array(['1', '2', '3', ..., '278856', '278857', '278858'], dtype=object)

In [ ]:
users['Age'].unique()

array([ 34.7514337,  18.       ,  17.       ,  61.       ,  26.       ,
        14.       ,  25.       ,  19.       ,  46.       ,  55.       ,
        32.       ,  24.       ,  20.       ,  34.       ,  23.       ,
        51.       ,  31.       ,  21.       ,  44.       ,  30.       ,
        57.       ,  43.       ,  37.       ,  41.       ,  54.       ,
        42.       ,  50.       ,  39.       ,  53.       ,  47.       ,
        36.       ,  28.       ,  35.       ,  13.       ,  58.       ,
        49.       ,  38.       ,  45.       ,  62.       ,  63.       ,
        27.       ,  33.       ,  29.       ,  66.       ,  40.       ,
        15.       ,  60.       ,   0.       ,  79.       ,  22.       ,
        16.       ,  65.       ,  59.       ,  48.       ,  72.       ,
        56.       ,  67.       ,   1.       ,  80.       ,  52.       ,
        69.       ,  71.       ,  73.       ,  78.       ,   9.       ,
        64.       , 103.       , 104.       ,  12.       ,  74.       ,
        75.       , 231.       ,   3.       ,  76.       ,  83.       ,
        68.       , 119.       ,  11.       ,  77.       ,   2.       ,
        70.       ,  93.       ,   8.       ,   7.       ,   4.       ,
        81.       , 114.       , 230.       , 239.       ,  10.       ,
         5.       , 148.       , 151.       ,   6.       , 101.       ,
       201.       ,  96.       ,  84.       ,  82.       ,  90.       ,
       123.       , 244.       , 133.       ,  91.       , 128.       ,
        94.       ,  85.       , 141.       , 110.       ,  97.       ,
       219.       ,  86.       , 124.       ,  92.       , 175.       ,
       172.       , 209.       , 212.       , 237.       ,  87.       ,
       162.       , 100.       , 156.       , 136.       ,  95.       ,
        89.       , 106.       ,  99.       , 108.       , 210.       ,
        88.       , 199.       , 147.       , 168.       , 132.       ,
       159.       , 186.       , 152.       , 102.       , 116.       ,
       200.       , 115.       , 226.       , 137.       , 207.       ,
       229.       , 138.       , 109.       , 105.       , 228.       ,
       183.       , 204.       ,  98.       , 223.       , 113.       ,
       208.       , 107.       , 157.       , 111.       , 146.       ,
       118.       , 220.       , 143.       , 140.       , 189.       ,
       127.       ])

In [ ]:
users.loc[(users['Age'] > 90) | (users['Age'] < 5)] = np.nan

In [ ]:
users['Age'].fillna((users['Age'].mean()), inplace=True)
users['Age'].unique()

array([34.7514337 , 18.        , 17.        , 61.        , 26.        ,
       14.        , 25.        , 19.        , 46.        , 55.        ,
       32.        , 24.        , 20.        , 34.        , 23.        ,
       51.        , 31.        , 21.        , 44.        , 30.        ,
       57.        , 43.        , 37.        , 41.        , 54.        ,
       42.        , 50.        , 39.        , 53.        , 47.        ,
       36.        , 28.        , 35.        , 13.        , 58.        ,
       49.        , 38.        , 45.        , 62.        , 63.        ,
       27.        , 33.        , 29.        , 66.        , 40.        ,
       15.        , 60.        , 34.73485224, 79.        , 22.        ,
       16.        , 65.        , 59.        , 48.        , 72.        ,
       56.        , 67.        , 80.        , 52.        , 69.        ,
       71.        , 73.        , 78.        ,  9.        , 64.        ,
       12.        , 74.        , 75.        , 76.        , 83.        ,
       68.        , 11.        , 77.        , 70.        ,  8.        ,
        7.        , 81.        , 10.        ,  5.        ,  6.        ,
       84.        , 82.        , 90.        , 85.        , 86.        ,
       87.        , 89.        , 88.        ])

In [ ]:
print(is_numeric_dtype(users['Age']))

True

In [ ]:
users.head()

  User-ID                            Location        Age
0       1                  nyc, new york, usa  34.751434
1       2           stockton, california, usa  18.000000
2       3     moscow, yukon territory, russia  34.751434
3       4           porto, v.n.gaia, portugal  17.000000
4       5  farnborough, hants, united kingdom  34.751434

In [ ]:
#I want to split the location into city, state and country
print(type(users['Location']))

<class 'pandas.core.series.Series'>

In [ ]:
location_series = users['Location']

def split_location(location):
    if pd.notna(location):
        parts = [part.strip() for part in location.split(',')]
        city = parts[0] if len(parts) > 0 else None
        state = parts[1] if len(parts) > 1 else None
        country = parts[2] if len(parts) > 2 else None
        return pd.Series({'City': city, 'State': state, 'Country': country})
    else:
        return pd.Series({'City': None, 'State': None, 'Country': None})

split_location_result = location_series.apply(split_location)

users = pd.concat([users, split_location_result], axis=1)

users = users.drop('Location', axis=1)

print(users)

       User-ID        Age         City            State         Country
0            1  34.751434          nyc         new york             usa
1            2  18.000000     stockton       california             usa
2            3  34.751434       moscow  yukon territory          russia
3            4  17.000000        porto         v.n.gaia        portugal
4            5  34.751434  farnborough            hants  united kingdom
...        ...        ...          ...              ...             ...
278853  278854  34.751434     portland           oregon             usa
278854  278855  50.000000       tacoma       washington  united kingdom
278855  278856  34.751434     brampton          ontario          canada
278856  278857  34.751434    knoxville        tennessee             usa
278857  278858  34.751434       dublin              n/a         ireland

[278858 rows x 5 columns]

In [ ]:
users.drop_duplicates(keep='last', inplace=True)
users.reset_index(drop=True, inplace=True)

In [ ]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277547 entries, 0 to 277546
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  277546 non-null  object
 1   Age      277547 non-null  float64
 2   City     277546 non-null  object
 3   State    277545 non-null  object
 4   Country  277544 non-null  object
dtypes: float64(1), object(4)
memory usage: 10.6+ MB

In [ ]:
users.head()

  User-ID        Age         City            State         Country
0       1  34.751434          nyc         new york             usa
1       2  18.000000     stockton       california             usa
2       3  34.751434       moscow  yukon territory          russia
3       4  17.000000        porto         v.n.gaia        portugal
4       5  34.751434  farnborough            hants  united kingdom

In [ ]:
users.info()

In [ ]:
users['User-ID'] = users['User-ID'].astype('int32')

In [225]:
dataset = pd.merge(books, ratings, left_on='ISBN', right_on='isbn', how='inner')
dataset = pd.merge(dataset, users, left_on='user_id', right_on='User-ID', how='inner')
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1031609 entries, 0 to 1031608
Data columns (total 11 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   ISBN                 1031609 non-null  object
 1   Book-Title           1031609 non-null  object
 2   Book-Author          1031609 non-null  object
 3   Year-Of-Publication  1031609 non-null  int32
 4   Publisher            1031609 non-null  object
 5   Image-URL-S          1031609 non-null  object
 6   Image-URL-M          1031609 non-null  object
 7   Image-URL-L          1031609 non-null  object
 8   user_id              1031609 non-null  int32
 9   isbn                 1031609 non-null  object
 10  book_rating          1031609 non-null  int32
dtypes: int32(3), object(8)
memory usage: 74.8+ MB

In [223]:
users.to_csv('../cleaned data/output_file.csv', index=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277547 entries, 0 to 277546
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  277546 non-null  object
 1   Age      277547 non-null  float64
 2   City     277546 non-null  object
 3   State    277545 non-null  object
 4   Country  277544 non-null  object
dtypes: float64(1), object(4)
memory usage: 10.6+ MB